droneshire/ti/ccsv7/ccs_base/common/targetdb/Modules/C2000/f2837xd_dma_cla_src_sel_regs.xml
<module id="DMA_CLA_SRC_SEL_REGS" HW_revision="" description="DMA CLA SRC SEL Registers">
	<register id="CLA1TASKSRCSELLOCK" width="32" page="1" offset="0x0" internal="0" description="CLA1 Task Trigger Source Select Lock Register">
		<bitfield id="CLA1TASKSRCSEL1" description="CLA1TASKSRCSEL1 Register Lock bit" begin="0" end="0" width="1" rwaccess="R/SOnce"/>
		<bitfield id="CLA1TASKSRCSEL2" description="CLA1TASKSRCSEL2 Register Lock bit" begin="1" end="1" width="1" rwaccess="R/SOnce"/>
	</register>
	<register id="DMACHSRCSELLOCK" width="32" page="1" offset="0x4" internal="0" description="DMA Channel Triger Source Select Lock Register">
		<bitfield id="DMACHSRCSEL1" description="DMACHSRCSEL1 Register Lock bit" begin="0" end="0" width="1" rwaccess="R/SOnce"/>
		<bitfield id="DMACHSRCSEL2" description="DMACHSRCSEL2 Register Lock bit" begin="1" end="1" width="1" rwaccess="R/SOnce"/>
	</register>
	<register id="CLA1TASKSRCSEL1" width="32" page="1" offset="0x6" internal="0" description="CLA1 Task Trigger Source Select Register-1">
		<bitfield id="TASK1" description="Selects the Trigger Source for TASK1 of CLA1" begin="7" end="0" width="8" rwaccess="R/W"/>
		<bitfield id="TASK2" description="Selects the Trigger Source for TASK2 of CLA1" begin="15" end="8" width="8" rwaccess="R/W"/>
		<bitfield id="TASK3" description="Selects the Trigger Source for TASK3 of CLA1" begin="23" end="16" width="8" rwaccess="R/W"/>
		<bitfield id="TASK4" description="Selects the Trigger Source for TASK4 of CLA1" begin="31" end="24" width="8" rwaccess="R/W"/>
	</register>
	<register id="CLA1TASKSRCSEL2" width="32" page="1" offset="0x8" internal="0" description="CLA1 Task Trigger Source Select Register-2">
		<bitfield id="TASK5" description="Selects the Trigger Source for TASK5 of CLA1" begin="7" end="0" width="8" rwaccess="R/W"/>
		<bitfield id="TASK6" description="Selects the Trigger Source for TASK6 of CLA1" begin="15" end="8" width="8" rwaccess="R/W"/>
		<bitfield id="TASK7" description="Selects the Trigger Source for TASK7 of CLA1" begin="23" end="16" width="8" rwaccess="R/W"/>
		<bitfield id="TASK8" description="Selects the Trigger Source for TASK8 of CLA1" begin="31" end="24" width="8" rwaccess="R/W"/>
	</register>
	<register id="DMACHSRCSEL1" width="32" page="1" offset="0x16" internal="0" description="DMA Channel Trigger Source Select Register-1">
		<bitfield id="CH1" description="Selects the Trigger and Sync Source CH1 of DMA" begin="7" end="0" width="8" rwaccess="R/W"/>
		<bitfield id="CH2" description="Selects the Trigger and Sync Source CH2 of DMA" begin="15" end="8" width="8" rwaccess="R/W"/>
		<bitfield id="CH3" description="Selects the Trigger and Sync Source CH3 of DMA" begin="23" end="16" width="8" rwaccess="R/W"/>
		<bitfield id="CH4" description="Selects the Trigger and Sync Source CH4 of DMA" begin="31" end="24" width="8" rwaccess="R/W"/>
	</register>
	<register id="DMACHSRCSEL2" width="32" page="1" offset="0x18" internal="0" description="DMA Channel Trigger Source Select Register-2">
		<bitfield id="CH5" description="Selects the Trigger and Sync Source CH5 of DMA" begin="7" end="0" width="8" rwaccess="R/W"/>
		<bitfield id="CH6" description="Selects the Trigger and Sync Source CH6 of DMA" begin="15" end="8" width="8" rwaccess="R/W"/>
	</register>
</module>
